{
    "socialLinks": {
        "github": "https://github.com/Vikas100702",
        "linkedin": "https://linkedin.com/in/Vikas100702",
        "discord": "https://discord.com/users/vikasverma_07",
        "telegram": "https://t.me/vikas_verma_7",
        "twitter": "https://x.com/vikas_verma77",
        "gmail": "mailto:vikasportfolio2002@gmail.com",
        "upwork": "https://www.upwork.com/freelancers/~017e5df96d30eb2a82?mp_source=share"
    },
    "aboutMe": "Hi, I'm Vikas Verma, a dedicated and passionate software developer with a strong focus on building scalable, efficient, and user-friendly applications. I specialize in cross-platform mobile development using Flutter and Dart, where I create visually appealing and high-performance applications with seamless UI/UX designs. My expertise extends to Kotlin for Android development, Firebase for backend integration, and SQL for database management, ensuring robust and dynamic solutions for real-world problems. I completed my Master's degree in Computer Applications (MCA) at Galgotias University, where I continue to expand my knowledge and technical skills. I have a solid foundation in programming languages like Java, JavaScript, HTML, and CSS, and I am proficient in using tools like GitHub for version control and collaborative development. I am always eager to explore new technologies and frameworks to deliver innovative solutions. My goal is to continuously grow as a developer, contribute to impactful projects, and make a meaningful difference in the tech world.",
    "skills": [
        {
            "name": "Flutter & Dart",
            "description": "Expert in building cross-platform applications with beautiful UI/UX design using Flutter and Dart. Skilled in advanced state management for efficient and scalable app development.",
            "icon": "bx bxl-flutter"
        },
        /*{
            "name": "Kotlin",
            "description": "Experienced in Kotlin, with a focus on developing modern, concise, and efficient Android applications using industry best practices.",
            "icon": "bx bxl-android"
        },*/
        {
            "name": "Fast API",
            "description": "Skilled in architecting scalable backend systems and robust APIs with a focus on developer speed and code efficiency.",
            "icon": "bx bx-bolt-circle"
        },
        {
            "name": "Docker",
            "description": "Streamlining deployment pipelines by packaging applications and dependencies into lightweight, portable containers.",
            "icon": "bx bxl-docker"
        },
        {
            "name": "Postman",
            "description": "Streamlining API development by creating shared collections, mocking endpoints, and maintaining up-to-date documentation.",
            "icon": "bx bx-paper-plane"
        },
        {
            "name": "AWS (EC2, S3)",
            "description": "Proficient in managing cloud infrastructure, utilizing EC2 for scalable compute capacity and S3 for durable data storage.",
            "icon": "bx bxl-aws"
        },        
        {
            "name": "Firebase",
            "description": "Skilled in Firebase, adept at integrating real-time databases, authentication, and cloud services to build dynamic and scalable applications.",
            "icon": "bx bxl-firebase"
        },
        {
            "name": "SQL",
            "description": "Experienced in SQL, with expertise in designing and managing databases, writing efficient queries, and ensuring data integrity.",
            "icon": "bx bxs-data"
        },
        {
            "name": "Github",
            "description": "Proficient in GitHub, skilled in version control, collaborative development, and managing code repositories for efficient project workflows.",
            "icon": "bx bxl-github"
        }    
    ],
    "projects": [
        {
            "name": "CosmosPedia",
            "description": "A Personalized Astronomical Companion that provides users with an interactive space exploration experience.",
            "image": "images/projects/cosmospedia.png",
            "github": "https://github.com/Vikas100702/Cosmospedia"           
        },
        {
            "name": "Iter",
            "description": "Chat platform that integrates intelligent AI features to provide a superior user experience.",
            "image": "images/projects/iter.png",
            "github": "https://github.com/Vikas100702/Iter"
        },
        {
            "name": "Dog Breed Detection App",
            "description": "The Dogs Breed Detection App is a Flutter-based mobile application designed to identify and classify dog breeds using machine learning. The app leverages TensorFlow Lite (TFLite) for real-time image processing and breed detection, demonstrating the flexibility of the machine learning model.",
            "image": "images/projects/dog-breed-detection.png",
            "github": "https://github.com/Vikas100702/dogs_breed_detection_app"
        },
        {
            "name": "TuneHub",
            "description": "Discover a seamless and immersive music experience with TuneHub, the ultimate music player app designed for music lovers. Built with Flutter and powered by GetX for state management, TuneHub offers a sleek, modern interface and powerful features to enhance your music listening experience.",
            "image": "images/projects/tunehub.png",
            "github": "https://github.com/Vikas100702/TuneHub"
        },
        {
            "name": "Mini Grocery App",
            "description": "Your one-stop solution for seamless grocery shopping! Built with Flutter and powered by BLoC state management, this app offers a smooth and intuitive shopping experience. Browse through a wide range of products, add them to your cart or wishlist, and manage your grocery list effortlessly.",
            "image": "images/projects/mini-grocery-app.png",
            "github": "https://github.com/Vikas100702/Mini-Grocery-App"
        }        
    ],
    "resume": "files/VIKAS_VERMA_CV.pdf",
    "profilePic": "images/profile-pic.jpg"
}
